# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "node"
brew "coreutils"
brew "nvm"
brew "tree"
brew "eza"
brew "zoxide"
brew "fzf"
brew "wget"
brew "yarn"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
brew "wifi-password"
brew "speedtest"
brew "bat"
brew "trash-it"
brew "youtube-dl"
brew "watchman" # Watching files for Jest
brew "git"
brew "wget"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"

# Utils
cask "gpg-suite"
# cask "openvpn-connect"

# Media
cask "spotify"
cask "vlc"
cask "plex"
cask "obs"
cask "screenflow"

# Development
cask "fig"
cask "multipass"
cask "iterm2"
cask "warp"
cask "visual-studio-code"
cask "github"
cask "docker"

# Design
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "figma"

# Desktop applications
cask "telegram"
cask "arc"
cask "google-chrome"
cask "microsoft-edge"
cask "firefox"
cask "brave-browser"
cask "slack"
cask "steam"
cask "spotify"
cask "notion"
cask "discord"
cask "raycast"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "balenaetcher"
cask "protonvpn"
cask "protonmail-bridge"
cask "proton-mail"
cask "proton-pass"
cask "cloudflare-warp"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Home Assistant", id: 1099568401
mas "Bitwarden", id: 1352778147
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 12848638472
# mas "NordVPN", id: 905953485
mas "The Unarchiver",  id: 425424353
mas "Pandan", id: 1569600264